# Задача 2. Долги

name_debit = input('Введите имя: ')
kredit = input('Введите долг: ')

print('{0}! {0}, привет! Как дела, {0}? Где мои {1} рублей? {0}!'.format(name_debit, kredit))
